app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("payer", "points", "timestamp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["payer", "DANNON"], ["points", 300], ["timestamp", "2020-10-31 10:00:00"], ["created_at", "2021-09-27 23:31:17.729322"], ["updated_at", "2021-09-27 23:31:17.729322"]]
---
  def create
    render json: Transaction.create(transactions_params)

SELECT "transactions"."payer", SUM(points) AS points FROM "transactions" GROUP BY "transactions"."payer"
SELECT "transactions"."payer", SUM(points) as points FROM "transactions" GROUP BY "transactions"."payer"
---
  def index
    group_of_payers= Transaction.select(:payer, "SUM(points) as points").group(:payer);

    results={}

    group_of_payers.each do |group|

SELECT "transactions"."points" FROM "transactions"
SELECT "transactions".* FROM "transactions" ORDER BY "transactions"."timestamp" ASC
DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 1]]
UPDATE "transactions" SET "points" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["points", 5300], ["updated_at", "2021-09-28 02:09:05.565017"], ["id", 2]]
---
  def spend
    points_to_spend= params[:points].to_i
    spent_points={}
    if Transaction.pluck(:points).sum > points_to_spend
      Transaction.order(timestamp: :asc).each do |transaction|
        if transaction.points < points_to_spend
          points_to_spend -= transaction.points
          spent_points[transaction.payer] = (spent_points[transaction.payer] || 0) - transaction.points
          transaction.destroy
        else
          spent_points[transaction.payer] = (spent_points[transaction.payer] || 0) - points_to_spend
          transaction.update(points: transaction.points- points_to_spend)